<?php
return [
    'permission'  => 'разрешение',
    'permissions' => 'Разрешения',
    'icon'        => 'unlock-alt',
    //
    'name'        => 'Псевдоним',
    'title'       => 'Наименование',
    'description' => 'Описание',
    'created'     => 'Разрешение успешно создано',
    'updated'     => 'Разрешение успешно обновлено',
    'deleted'     => 'Разрешение успешно удалено',
    'list'        => 'список разрешений',
    'with' => 'с разрешением',
    'placeholder' => [
        'name'        => 'Например, profile',
        'title'       => 'Например, Профиль',
        'description' => 'Например, Открывает доступ к профилю пользователя',
        'search'      => 'Поиск разрешений...'
    ],
    'help'        => [
        'name' => '<b>Внимание!</b> Редактирование псевдонима запрещено',
    ],
];