<?php
return [
    'role'        => 'роль',
    'roles'       => 'Роли',
    'icon' => 'graduation-cap',
    //
    'name'        => 'Псевдоним',
    'title'       => 'Наименование',
    'description' => 'Короткое описание',
    'created'     => 'Роль успешно создана',
    'updated'     => 'Роль успешно обновлена',
    'deleted'     => 'Роль успешно удалена',
    'list'        => 'список ролей',
    'placeholder' => [
        'name'        => 'Например, asc',
        'title'       => 'Например, АСЦ',
        'description' => 'Например, Авторизованный сервисный центр',
        'search'      => 'Поиск ролей...',
    ],
    'help' => [
        'name'        => '<b>Внимание!</b> После создания роли редактирование этого поля запрещено',
    ],
];