<?php
return [

    'delimiter' => '|',

    'cache' => [
        'use' => false,
        'ttl' => 60 * 60 * 24
    ],

    'per_page' => [
        'permission' => 100,
        'role'       => 100,
    ],

    'seeders' => [
        'roles',
        'permissions',
        'permission_role',
    ],

    'middleware' => [

        /*
        |--------------------------------------------------------------------------
        | Метод для обработки неавторизованных действий пользователя
        |--------------------------------------------------------------------------
        |
        | Доступные действия: abort|redirect
        |
        */

        'handler' => 'abort',

        /*
        |--------------------------------------------------------------------------
        | Методы-обработчики
        |--------------------------------------------------------------------------
        */

        'handlers' => [

            /*
            |--------------------------------------------------------------------------
            | Вызов 403 ошибки
            |--------------------------------------------------------------------------
            */

            'abort' => [
                'code' => 403
            ],

            /*
            |--------------------------------------------------------------------------
            | Редирект на web-адрес
            |--------------------------------------------------------------------------
            |
            | Редирект выполняется по пути url
            | Если нужно показать сообщение, необходимо заполнить content
            | Если content оставить пустым, сообщение не будет показано
            |
            */

            'redirect' => [
                'url'     => '/home',
                'message' => [
                    'type'    => 'error',
                    'content' => ''
                ]
            ]
        ]

    ],

];